<?php

/**
 * @brief        正则表达式规则配置
 *
 * @author       Feng <mail.gzf@foxmail.com>
 * @since        2015-1-15 17:36:51
 * @copyright    (C) bootstrapd
 */

namespace bootstrapd\library\util\form;

class RegexpConfig {

    //整数
    const INT             = '/^[1-9]\d*$/';

    //数字
    const NUMBER          = '/^\d+\.?\d*$/';

    //数字及替代符号
    const NUMBER_ALIKE    = '/[⒈⒉⒊⒋⒌⒍⒎⒏⒐⑴⑵⑶⑷⑸⑹⑺⑻⑼①②③④⑤⑥⑦⑧⑨❶❷❸❹❺❻❼❽❾㈠㈡㈢㈣㈤㈥㈦㈧㈨一二三四五六七八九零壹贰叁肆伍陆柒捌玖零０１２３４５６７８９0-9]/u';

    //一位浮点型
    const FLOAT1          = '/^\d+(\.\d)?$/';

    //二位浮点型
    const FLOAT2          = '/^\d+(\.\d{1,2})?$/';

    //仅中文(限js)
    const CN              = '/^[\u4E00-\u9FA5\uF900-\uFA2D]+$/';

    //邮件
    const EMAIL           = '/^\w+((-|\.)\w+)*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/';

    //颜色
    const COLOR           = '/^#?[a-fA-F0-9]{6}$/';

    //url
    const URL             = '/^http[s]?:\/\/[\w-]+\..*$/';

    //仅ACSII字符
    const ASCII           = '/^[\x00-\xFF]+$/';

    //邮编
    const ZIPCODE         = '/^\d{6}$/';

    //ip地址
    const IP4             = '/^(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)$/';

    //非空
    const NOT_EMPTY       = '/^\S+$/';

    //图片
    const IMAGE           = '/(.*)\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)$/i';

    //压缩文件
    const ZIP             = '/(.*)\.(rar|zip|7zip|tgz)$/i';

    //日期
    const DATE            = '/^\d{4}(-|\/|\.)\d{1,2}\1\d{1,2}$/';

    //QQ号码 匹配 5到11位数字
    const QQ              = '/^[1-9]{1,1}[0-9]{4,10}$/';

    //手机
    const MOBILE          = '/^1[34578]\d{9}$/';

    //电话号码的验证(包括验证国内区号,国际区号,分机号)
    const PHONE           = '/^1[34578]\d{9}$|^(0\d{2,4}-)?[2-9]\d{6,7}(-\d{2,6})?$|^(?!\d+(-\d+){4,})[48]00(-?\d){7,16}$/';

    //包含电话号码，与PHONE区别是去掉开始符和结束符^$
    const INCLUDE_PHONE   = '/1[34578]\d{9}|(0\d{2,4}-)?[2-9]\d{6,7}(-\d{2,6})?|(?!\d+(-\d+){4,})[48]00(-?\d){7,16}/';

    //固定电话
    const FIXED_PHONE     = '/^(0\d{2,4}-)?[2-9][0-9]{6,7}(-\d{2,6})?$/';

    //特殊字符
    const NO_SPECIAL      = '/※|◆|▌|▎|▏|▓|▔|▕|■|□|▲|△|▼|▽|◆|◇|○|☉|☆|★|◥|◤|◣|◢|●|◎|♀|♂|〓|㊣|℅|【|】|▇|▇██|▇▇▇██▇▇▇▇█|▇▇▇▇|██▇|██|▄▄|▄|▁|▃▂|█|▂/';

    //屏蔽的网址
    const URL_DISABLED    = '/\.(58|baixing|koubei)(\.(net|cn|com))+/i';

    //车辆类别电话验证，400电话增加一位
    const VEHICLE_PHONE   = '/^1[34578]\d{9}$|^(0\d{2,4}-)?[2-9]\d{6,7}(-\d{2,6})?$|^(?!\d+(-\d+){3,})[48]00(-?\d){7,13}$/';

    //招聘类别验证手机和电话，电话必须以区号开头，例如：010-; for 橄榄树添加PPC绑定手机
    const JOB_PHONE       = '/^1[34578]\d{9}$|^(0\d{2,4}-)[2-9]\d{6,7}$|^[48]00\d?(-\d{3,4}){2}$/';

    //汉字或字母，for联系人等
    const CHINESE_ENGLISH = '/^[\x{4e00}-\x{9fa5}a-zA-Z]+$/u';

}
